package home_work.lesson3;

/**
 * Вывести на экран последовательность чисел от 0 до n в обратном порядке
 */

public class Easy {
    public static void main(String[] args) {
        for (int i = 10; i >= 0; i--) {
            System.out.print(i + " ");
        }
    }
}
